# Assignment

## Brief

Write the Python codes for the following questions.

## Instructions

Paste the answer as Python in the answer code section below each question.

### Question 1

Question: Select all numeric columns except float from the DataFrame `dft`.

Answer:

In [4]:
import pandas as pd
import numpy as np

In [34]:
dft = pd.DataFrame(
    {
        "A": np.random.rand(3), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 3).astype("float32"), 
        "F": False, 
        "G": pd.Series([1] * 3, dtype="int8")})

dft

          A  B    C          D    E      F  G
0  0.793268  1  foo 2001-01-02  1.0  False  1
1  0.120586  1  foo 2001-01-02  1.0  False  1
2  0.678217  1  foo 2001-01-02  1.0  False  1

In [35]:
dft.select_dtypes(include="number", exclude="float")

   B  G
0  1  1
1  1  1
2  1  1

### Question 2

Question: How do you return the last 3 rows of a DataFrame `df`?

Answer:

In [18]:
rng = np.random.default_rng(seed=1)

df = pd.DataFrame(rng.integers(1, 13, (5, 6)))

df

    0   1   2   3   4  5
0   6   7  10  12   1  2
1  10  12   3   4  11  6
2   4  10   4   5   8  7
3   2   1  11  10  11  7
4  10   4   6  10   2  4

In [19]:
df.tail(3)

    0   1   2   3   4  5
2   4  10   4   5   8  7
3   2   1  11  10  11  7
4  10   4   6  10   2  4

### Question 3

Question: Return the minimum and maximum of a Series `x` as a new Series with the index `["min", "max"]`.

Answer:

In [20]:
rng = np.random.default_rng(seed=0)

x = pd.Series(rng.integers(0, 50, 6))

x

0    42
1    31
2    25
3    13
4    15
5     2
dtype: int64

In [21]:
pd.Series([x.min(), x.max()], index=["min", "max"])

min     2
max    42
dtype: int64

### Question 4

Question: Multiply `df1` and `df2` (two DataFrames) with a `fill_value` of 1.

Answer:

In [29]:
rng = np.random.default_rng(seed=42)

df1 = pd.DataFrame(rng.integers(1, 13, (4, 3)))
df1.iloc[:1] = np.NaN  

df2 = pd.DataFrame(rng.integers(2, 14, (4, 3)))
df2.iloc[-1] = np.NaN

df1

     0    1     2
0  NaN  NaN   NaN
1  6.0  6.0  11.0
2  2.0  9.0   3.0
3  2.0  7.0  12.0

In [30]:
df2

      0     1     2
0  10.0  11.0  10.0
1  11.0   8.0   3.0
2  12.0   7.0   8.0
3   NaN   NaN   NaN

In [31]:
df1.mul(df2, fill_value=1)

      0     1     2
0  10.0  11.0  10.0
1  66.0  48.0  33.0
2  24.0  63.0  24.0
3   2.0   7.0  12.0

### Question 5

Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [32]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

Answer:

In [33]:
pd.DataFrame.from_dict(nested_dict, orient="index")

   a  b
A  1  2
B  3  4

## Submission

- Submit the URL of the GitHub Repository that contains your work to NTU black board.
- Should you reference the work of your classmate(s) or online resources, give them credit by adding either the name of your classmate or URL.